# Parameter Type Id Sheet Scale Override Property

Source: https://www.revitapidocs.com/2026/3bc61563-19a8-656f-e2a8-1b90977f86b9.htm

---

| Parameter Type Id Sheet Scale Override Property |
| --- |

"Scale Override (Multiple Values)"
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static ForgeTypeId SheetScaleOverride { get; }
```

```
Public Shared ReadOnly Property SheetScaleOverride As ForgeTypeId
	Get
```

```
public:
static property ForgeTypeId^ SheetScaleOverride {
	ForgeTypeId^ get ();
}
```

```
static member SheetScaleOverride : ForgeTypeId with get
```

#### Property Value

ForgeTypeId See Also

#### Reference

ParameterTypeId Class Autodesk.Revit.DB Namespace